{"original_url": "https://www.skinnytaste.com/air-fryer-rotisserie-chicken/", "credit_to": "SkinnyTaste", "author": "SkinnyTaste", "name": "Air Fryer Rotisserie Chicken", "prep_time": 10.0, "cook_time": 60.0, "ingredients": [{"ingred_name": "Kosher salt", "amount": "2", "unit": "teaspoons", "notes": null}, {"ingred_name": "sweet paprika", "amount": "1/2", "unit": "teaspoon", "notes": null}, {"ingred_name": "garlic powder", "amount": "1/2", "unit": "teaspoon", "notes": null}, {"ingred_name": "onion powder", "amount": "1/2", "unit": "teaspoon", "notes": null}, {"ingred_name": "dried oregano", "amount": "1/4", "unit": "teaspoon", "notes": null}, {"ingred_name": "dried thyme", "amount": "1/4", "unit": "teaspoon", "notes": null}, {"ingred_name": "ground sage", "amount": "1/4", "unit": "teaspoon", "notes": null}, {"ingred_name": "olive oil spray", "amount": null, "unit": null, "notes": null}, {"ingred_name": "whole chicken", "amount": "3", "unit": "pounds", "notes": "I buy organic, humane raised"}], "instructions": "Combine the spices in a small bowl. Spritz the chicken with olive oil and rub the spices all over, evenly. For a prettier bird, tightly tie the legs of the chicken together with a piece of butcher’s twine. At this point you can refrigerate uncovered until ready to cook. When ready to cook, transfer the chicken to the air fryer basket. Place the whole chicken in the air fryer, belly side down and air fry 350F about 25 minutes, until the top of the chicken is browned. Then flip over, and continue cooking about 25 minutes, or until the juices run clear and no longer pink when the thigh is pierced with a pairing knife near the joint, and the internal temperature is 165°F. For a larger bird, this will take more time. (Insert thermometer between the thickest part of the leg and the thigh) When the chicken’s done, remove it to a platter and let it rest for 10 minutes before carving and serving. Save carved carcass for stock if desired. Serve the chicken, skin is optional. To bake in the oven, bake 400F until golden and crisp and brown all over and the juices run clear when you insert a knife down to the bone between the leg and the thigh, or the internal temperature is 165°F, about 1 hour or longer as needed."}