{"original_url": "https://www.skinnytaste.com/bacon-spinach-breakfast-casserole/", "credit_to": "SkinnyTaste", "author": "SkinnyTaste", "name": "Bacon Spinach Breakfast Casserole with Gruyère", "prep_time": 10.0, "cook_time": 45.0, "ingredients": [{"ingred_name": "Cooking spray", "amount": null, "unit": null, "notes": null}, {"ingred_name": "center-cut bacon", "amount": "8", "unit": "slices", "notes": "chopped"}, {"ingred_name": "finely diced shallots", "amount": "½", "unit": "cup", "notes": null}, {"ingred_name": "package baby spinach", "amount": null, "unit": "5-ounce", "notes": null}, {"ingred_name": "shredded Gruyère cheese", "amount": "8", "unit": "ounces", "notes": "2 cups total (I like Finlandia)"}, {"ingred_name": "large eggs", "amount": "12", "unit": null, "notes": null}, {"ingred_name": "nonfat milk", "amount": "1", "unit": "cup", "notes": null}, {"ingred_name": "kosher salt", "amount": "½", "unit": "teaspoon", "notes": null}, {"ingred_name": "Freshly ground black pepper", "amount": null, "unit": null, "notes": "to taste"}], "instructions": "Preheat oven to 350 degrees F. Spray a 9” x 13” casserole dish with cooking spray and set aside. In a large skillet, cook the bacon over medium heat until cooked through. Using a slotted spoon, transfer the bacon to a paper towel lined plate. Remove and discard all but 2 tablespoons of the bacon grease then add the shallots. Sauté the shallots until fragrant and they start to brown on the edges, about 2 minutes. Add half the spinach and toss to mix with the shallots then add the rest and toss again. Cook, stirring and tossing for about 3 minutes, until spinach is wilted.  Remove the pan from heat and set aside. In a large bowl, whisk the eggs. Set aside 1 cup of the cheese then add the remainder to the eggs. Add the milk, salt, pepper, cooked spinach mixture and bacon then mix to thoroughly combine. Pour egg mixture into the prepared dish then sprinkle remaining cheese evenly over the top. Bake for 35 minutes, then move the oven rack to the second slot closest to the top, switch the oven to broil and cook an additional 2-3 minutes, until browned, watching closely to make sure it doesn’t burn. Allow to cool for 10 minutes then cut into 8 pieces and serve immediately."}