{"original_url": "https://www.skinnytaste.com/crock-pot-buffalo-chicken-lettuce-wraps/", "credit_to": "SkinnyTaste", "author": "SkinnyTaste", "name": "Buffalo Chicken Lettuce Wraps (Slow Cooker, Instant Pot)", "prep_time": 5.0, "cook_time": 240.0, "ingredients": [{"ingred_name": "3 boneless skinless chicken breasts", "amount": "24", "unit": "oz", "notes": null}, {"ingred_name": "celery stalk", "amount": "1", "unit": null, "notes": "diced"}, {"ingred_name": "onion", "amount": "1/2", "unit": null, "notes": "diced"}, {"ingred_name": "garlic", "amount": "1", "unit": "clove", "notes": "minced"}, {"ingred_name": "fat free low sodium chicken broth", "amount": "16", "unit": "oz", "notes": null}, {"ingred_name": "cayenne pepper sauce", "amount": "1/2", "unit": "cup", "notes": "I used Frank’s"}, {"ingred_name": "large lettuce leaves", "amount": "6", "unit": null, "notes": "Bibb or Iceberg"}, {"ingred_name": "shredded carrots", "amount": "1 1/2", "unit": "cups", "notes": null}, {"ingred_name": "large celery stalks", "amount": "2", "unit": null, "notes": "cut into 2 inch matchsticks"}], "instructions": "In a slow cooker, combine chicken, onions, celery stalk, garlic and broth (enough to cover your chicken, use water if the can of broth isn’t enough). Cover and cook on high 4 hours. Remove the chicken from pot, reserve 1/2 cup broth and discard the rest. Shred the chicken with two forks, return to the slow cooker with the 1/4 to 1/2 cup broth and the hot sauce and set to on high for an additional 30 minutes. Makes 3 cups chicken. To prepare lettuce cups, place 1/2 cup buffalo chicken in each leaf, top with 1/4 cup shredded carrots, celery and dressing of your choice. Wrap up and start eating! Combine chicken, onions, celery stalk, garlic and broth (enough to cover your chicken, use water if the can of broth isn’t enough) in the Instant Pot. Cover and cook high pressure 15 minutes. Natural release. Remove the chicken from pot, reserve 1/2 cup broth and discard the rest. Shred the chicken with two forks, return to the pot with the 1/4 to 1/2 cup broth and the hot sauce and saute 2 to 3 minutes. Makes 3 cups chicken. To prepare lettuce cups, place 1/2 cup buffalo chicken in each leaf, top with 1/4 cup shredded carrots, celery and dressing of your choice. Wrap up and start eating!"}