{"original_url": "https://www.skinnytaste.com/everything-bagel-pigs-in-a-blanket/", "credit_to": "SkinnyTaste", "author": "SkinnyTaste", "name": "Everything Bagel Pigs in a Blanket", "prep_time": 20.0, "cook_time": 25.0, "ingredients": [{"ingred_name": "unbleached all-purpose flour, whole wheat or gluten-free mix, ", "amount": "1", "unit": "cup", "notes": "plus more for dusting (5 ounces)"}, {"ingred_name": "baking powder", "amount": "2", "unit": "teaspoons", "notes": null}, {"ingred_name": "kosher salt", "amount": "3/4", "unit": "teaspoon", "notes": null}, {"ingred_name": "non-fat plain Greek yogurt", "amount": "1", "unit": "cup", "notes": "I recommend Stonyfield or Fage 0%"}, {"ingred_name": "egg white", "amount": "1", "unit": null, "notes": "beaten (whole egg works fine too)"}, {"ingred_name": "turkey hot dogs", "amount": "8", "unit": null, "notes": "such as Applegate Naturals, halved crosswise"}, {"ingred_name": "Everything Bagel seasoning", "amount": "2", "unit": "teaspoons", "notes": null}], "instructions": "Preheat oven to 400 degrees F. Line a baking sheet with a silicon baking mat or parchment paper. If using parchment paper, spray with oil to avoid sticking. In a medium bowl combine the flour, baking powder and salt and whisk well. Add the yogurt and mix with a fork or spatula until well combined, it will look like small crumbles. Lightly dust flour on a work surface and remove dough from the bowl, knead the dough a few times until dough is smooth and tacky, but not sticky, about 15 turns (it should not leave dough on your hand when you pull away). Divide dough into 16 equal balls. Dust your work surface and a rolling pin with more flour. Press a ball flat then roll into a  4 ½-inch oval. Wrap the dough around a hot dog half and place on the prepared baking sheet. Repeat with remaining hot dogs and dough. Brush each with the egg wash and sprinkle with Everything Bagel seasoning. Bake in oven for 25 minutes. Allow to cool for 10 minutes and serve."}