{"original_url": "https://www.skinnytaste.com/light-swiss-chard-frittata/", "credit_to": "SkinnyTaste", "author": "SkinnyTaste", "name": "Swiss Chard Frittata", "prep_time": 10.0, "cook_time": 30.0, "ingredients": [{"ingred_name": "large eggs", "amount": "4", "unit": null, "notes": null}, {"ingred_name": "large egg whites", "amount": "4", "unit": null, "notes": null}, {"ingred_name": "grated Swiss Cheese", "amount": "1/4", "unit": "cup", "notes": null}, {"ingred_name": "bunch Swish Chard", "amount": "1/2", "unit": null, "notes": "6 1/2 cups, washed well"}, {"ingred_name": "large white onion", "amount": "1", "unit": null, "notes": "sliced thin"}, {"ingred_name": "whipped butter", "amount": "2", "unit": "tsp", "notes": null}, {"ingred_name": "kosher salt and fresh pepper ", "amount": null, "unit": null, "notes": "to taste"}], "instructions": "Preheat the oven to 400F. In a medium bowl combine eggs, egg whites, cheese and a pinch of salt and pepper. Set aside. Separate the stems from the leaves of the chard. Dice the stem into small pieces. Roll the leaves up and slice into thin ribbons, about an 1/8-inch thick. Heat a 10-inch skillet on low heat; melt half of the butter and add the onions with a pinch of salt and pepper. Slowly cook the onions, stirring occasionally until the onions become translucent, about 8-10 minutes. Bring the heat up to medium and cook until the onions caramelize. Set the onions aside. Increase the heat to medium-high, add remaining butter and add the chard stems. Cook about 3-4 minutes. Add the chard leaves to the pan and cook until wilted, about 2-3 minutes. Season with salt and pepper. Reduce heat to low; pour egg mixture into the skillet and add caramelized onions, salt and pepper and mix well to blend. Reduce heat to low and cook until the edges set, about 6-8 minutes. Once the bottom and edges set, place in the oven and bake until completely set through, about 4-5 minutes. Remove from the oven and place a dish over the pan; flip onto the plate. Cut into wedges and serve."}