{"original_url": "https://www.skinnytaste.com/pizza-sausage-rolls/", "credit_to": "SkinnyTaste", "author": "SkinnyTaste", "name": "Pizza Sausage Rolls", "prep_time": 20.0, "cook_time": 30.0, "ingredients": [{"ingred_name": "unbleached all-purpose flour, plus more for dusting", "amount": "1", "unit": "cup", "notes": "(5 oz in weight) use cup4cup for GF*"}, {"ingred_name": "baking powder", "amount": "2", "unit": "teaspoons", "notes": null}, {"ingred_name": "kosher salt", "amount": "3/4", "unit": "teaspoon", "notes": null}, {"ingred_name": "non-fat Greek yogurt", "amount": "1", "unit": "cup", "notes": "(should be thick) I recommend Stonyfield"}, {"ingred_name": "egg white", "amount": "1", "unit": null, "notes": "beaten (whole egg works fine too)"}, {"ingred_name": "sesame seeds", "amount": null, "unit": null, "notes": "for topping (optional)"}, {"ingred_name": "raw chicken Italian sausage links", "amount": "2", "unit": null, "notes": "3 oz total (halved lengthwise) I like Premio"}, {"ingred_name": "provolone or mozzarella cheese", "amount": "4", "unit": "slices", "notes": null}, {"ingred_name": "pizza sauce or marinara", "amount": "8", "unit": "teaspoons", "notes": null}, {"ingred_name": "marinara sauce", "amount": null, "unit": null, "notes": "for serving (optional)"}], "instructions": "Preheat oven to 400 degrees F. Place parchment paper or a silpat on a baking sheet. If using parchment paper, spray with oil to avoid sticking. In a medium bowl combine the flour, baking powder and salt and whisk well. Add the yogurt and mix with a fork or spatula until well combined (it will be sticky and look like small crumbles). Lightly dust flour on a work surface and remove dough from the bowl, knead the dough a few times until dough is tacky, but not sticky, about 15 turns (it should not leave dough on your hand when you pull away). If it’s too sticky, add a few extra sprinkles of flour. Divide in 4 equal balls. Working with 1 ball at a time, lightly dust a rolling pin and a work surface and roll dough into a 5 ½” circle, about ¼” thick. Spread 2 teaspoons pizza sauce down the middle of the circle, leaving about 1/2” border. Lay 1 slice of cheese in the middle of the circle then top with 1/2 sausage link. Carefully bring both sides of the dough up, wrap one side around the sausage then the other. Press dough together so it’s sealed around the sausage and place it on the prepared sheet pan seam side-down. Repeat with remaining dough, sauce, cheese and sausage. Brush each with egg wash, top with sesame seeds, if using, and bake for 25-30 minutes.  Allow to cool for 5 minutes then slice into 6 pieces and serve."}