{"original_url": "https://www.skinnytaste.com/short-rib-soup-instant-pot-or-stove/", "credit_to": "SkinnyTaste", "author": "SkinnyTaste", "name": "Short Rib Soup", "prep_time": 15.0, "cook_time": 60.0, "ingredients": [{"ingred_name": "short ribs", "amount": "5", "unit": null, "notes": "about 4 oz each with bone, or 3 ounces each without, trimmed of excess fat"}, {"ingred_name": "shiitake mushrooms", "amount": "8", "unit": "ounces", "notes": "stems removed and sliced"}, {"ingred_name": "ginger", "amount": "1 1/2", "unit": "inches", "notes": "peeled, sliced into disks, and smashed"}, {"ingred_name": "scallions", "amount": "5", "unit": null, "notes": "3 whole, 1 chopped for garnish"}, {"ingred_name": "bunch cilantro", "amount": "1/2", "unit": null, "notes": "stems separated and leaves chopped"}, {"ingred_name": "beef broth", "amount": "8", "unit": "cups", "notes": null}, {"ingred_name": "whole black peppercorns", "amount": "1", "unit": "teaspoon", "notes": null}, {"ingred_name": "whole star anise", "amount": "3", "unit": null, "notes": null}, {"ingred_name": "Swiss chard", "amount": "1", "unit": "lb", "notes": "stems and leaves separated and coarsely chopped"}, {"ingred_name": "lime wedges", "amount": null, "unit": null, "notes": null}, {"ingred_name": "crushed red pepper flakes or sriracha", "amount": null, "unit": null, "notes": null}, {"ingred_name": "fresh ginger cut into thin matchsticks", "amount": null, "unit": null, "notes": null}], "instructions": "Place the short ribs in the Instant Pot with the mushrooms, ginger, 3 whole scallions, cilantro stems, peppercorns, star anise, and beef broth. Cover and cook high pressure, 1 hour then natural or quick release. As it cooks, prep your garnishes and set them aside. Divide the short ribs and mushrooms into 5 soup bowls, then strain the remaining broth, discard the remaining ingredients. Return the soup to the Instant Pot and press the “Saute” button to bring the soup to a simmer – as it heats, add the stems of the Swiss chard and simmer 3 minutes, then add the leaves and cook until bright green, about 2 to 3 minutes. Ladle the soup into the soup bowls, about 1 3/4 cups. Garnish with lime wedges, crushed red pepper flakes, ginger sticks, cilantro leaves, and scallions. Place the short ribs in a large pot or Dutch oven with the mushrooms, ginger, 3 whole scallions, cilantro stems, peppercorns, star anise, and beef broth. Bring to a boil, then cover and cook on low heat until the meat is tender, about 2 hours. As it cooks, prep your garnishes and set them aside. Divide the short ribs and mushrooms into 5 soup bowls, then strain the remaining broth, discard the remaining ingredients. Bring the soup to a simmer over high heat – as it heats, add the stems of the Swiss chard and simmer 3 minutes, then add the leaves and cook until bright green, about 2 to 3 minutes. Ladle the soup into the soup bowls, about 1 3/4 cups. Garnish with lime wedges, crushed red pepper flakes, ginger sticks, cilantro leaves, and scallions."}