{"original_url": "https://www.skinnytaste.com/sweet-potato-soup-with-sausage-and-kale/", "credit_to": "SkinnyTaste", "author": "SkinnyTaste", "name": "Sweet Potato Soup with Sausage and Kale", "prep_time": 10.0, "cook_time": 360.0, "ingredients": [{"ingred_name": "extra-virgin olive oil", "amount": "2", "unit": "teaspoons", "notes": null}, {"ingred_name": "mild Italian chicken sausage", "amount": "1", "unit": "pound", "notes": "casings removed*"}, {"ingred_name": "yellow onion", "amount": "1", "unit": null, "notes": "diced"}, {"ingred_name": "garlic", "amount": "4", "unit": "cloves", "notes": "minced"}, {"ingred_name": "apple cider vinegar", "amount": "1/2", "unit": "teaspoon", "notes": null}, {"ingred_name": "Adobo Seasoning", "amount": "2 1/2", "unit": "teaspoons", "notes": "*"}, {"ingred_name": "kosher salt", "amount": "1/2 ", "unit": "teaspoon", "notes": null}, {"ingred_name": "dried thyme", "amount": "1/2", "unit": "teaspoon", "notes": null}, {"ingred_name": "freshly ground black pepper", "amount": "1/2", "unit": "teaspoon", "notes": null}, {"ingred_name": "rosemary", "amount": "1", "unit": "sprig", "notes": null}, {"ingred_name": "orange-fleshed sweet potatoes", "amount": "1", "unit": "pound", "notes": "peeled and cubed"}, {"ingred_name": "unsalted chicken Bone Broth", "amount": "6", "unit": "cups", "notes": null}, {"ingred_name": "Dairy-Free Heavy Cream", "amount": "1/4", "unit": "cup", "notes": "optional "}, {"ingred_name": "lacinato (Tuscan kale) or Swiss chard", "amount": "1", "unit": "bunch", "notes": "stems and ribs removed and leaves torn (about 2 cups loosely packed)"}], "instructions": "In a large skillet, heat the oil over medium-high heat. Add the sausage and cook, breaking it up with a wooden spoon and stirring frequently, for 2 to 3 minutes, until browned. Add the onion and garlic and cook, stirring, for 1 to 2 minutes, until the onion begins to soften. Transfer to the slow cooker with the 6 cups broth, apple cider vinegar, adobo seasoning, salt, thyme, pepper, rosemary, and sweet potatoes. Cover and cook on low for 6 hours or on high for 3 hours. Remove and discard the rosemary sprig. Scoop out 1 cup of the broth, onion, and sweet potatoes, being careful to avoid the sausage, and transfer to a blender. Add the 1/4 cup cream, if using, to the blender, blend on high speed until smooth, and return the puree to the pot. Switch the slow cooker to high heat, add the kale, and simmer, covered, for 10 to 15 minutes, until thickened. Serve immediately. Transfer all the ingredients to the pressure cooker add 5 cups of the broth, apple cider vinegar, adobo seasoning, salt, thyme, pepper, rosemary, and sweet potatoes and cook for 10 minutes. Let the pressure release naturally. Remove and discard the rosemary sprig. Scoop out 1 cup of the broth onion and sweet potatoes being careful to avoid the sausage and transfer to a blender. Add the cream to the blender blend on high speed until smooth and return the puree to the pot. Add the kale turn the machine to sauté on high bring the soup to a boil and boil for 1 to 2 minutes until thickened. Serve immediately. Let this simmer in a large pot on the stove 1 1/2 hours, covered over low heat."}