{"original_url": "https://www.skinnytaste.com/veggie-stromboli/", "credit_to": "SkinnyTaste", "author": "SkinnyTaste", "name": "Veggie Stromboli", "prep_time": 20.0, "cook_time": 35.0, "ingredients": [{"ingred_name": "refrigerated or homemade pizza dough", "amount": "16", "unit": "ounce", "notes": null}, {"ingred_name": "olive oil", "amount": "1 1/2", "unit": "tbsp", "notes": "extra virgin"}, {"ingred_name": "kosher salt", "amount": "3/4", "unit": "tsp", "notes": null}, {"ingred_name": "thinly sliced cremini mushrooms", "amount": "8", "unit": "ounces", "notes": "stems trimmed"}, {"ingred_name": "medium red onion", "amount": "1", "unit": null, "notes": "chopped"}, {"ingred_name": "baby spinach", "amount": "3", "unit": "cups", "notes": null}, {"ingred_name": "garlic", "amount": "3", "unit": "cloves", "notes": "crushed"}, {"ingred_name": "part-skim shredded mozzarella cheese", "amount": "1", "unit": "cup", "notes": null}, {"ingred_name": "egg white", "amount": "1", "unit": null, "notes": "beaten"}, {"ingred_name": "sesame seeds", "amount": null, "unit": null, "notes": "optional for topping"}, {"ingred_name": "marinara sauce", "amount": null, "unit": null, "notes": "for serving"}], "instructions": "If the dough is refrigerated let it rest to room temp 1 hour before starting. Preheat the oven to 400F and set rack in the center of the oven. Heat a large non-stick skillet over medium-low heat and add 2 tablespoons extra virgin olive oil, when hot add the mushrooms and onions, season with 3/4 teaspoon kosher salt and black pepper, to taste and cook, stirring until tender, about 5 minutes. Add the spinach, a pinch of salt and cook until wilted, 2 to 3 minutes. Add garlic and cook 1 minute. Set aside to cool completely. (I usually place this outside in the winter to cool fast). Spray a nonstick sheet pan with oil or line with a silicone mat. With a rolling pin, roll out the dough on a floured surface to a 16 x 10 inch rectangle. Place the veggies over the dough leaving about 1 1/2 inch from the edge. Top with cheese. Use the egg wash and brush along the edge of the dough. Fold one side of the dough over to cover the filling, then the short edges, followed by the other side, stretching slightly to seal, pinching the ends so nothing oozes out. Lay the bread seam side down on the prepared pan. Cut small slats in the top and brush with egg white. Top with sesame seeds, if using. Bake 25 to 35 minutes, until golden brown on top and the dough is cooked on the end. Remove from the oven and let it cool 5 minutes before slicing into 8 pieces. Serve with marinara sauce on the side."}