{"original_url": "https://www.skinnytaste.com/stuffed-butternut-squash/", "credit_to": "SkinnyTaste", "title": "Stuffed Butternut Squash with Wild Rice and Sausage", "prep_time": "15 mins", "cook_time": "1 hr", "ingredients": [["butternut squash", "1", "large", "(about 2 pounds) halved lengthwise, seeded"], ["olive oil", "1", "tablespoon", null], ["kosher salt", "1/2", "teaspoon", null], ["freshly ground black pepper", null, null, "to taste"], ["uncooked wild rice", "1/2", "cup", null], ["water or broth", "1 1/2", "cups", "for cooking the rice"], ["olive oil", "1", "tablespoon", null], ["fresh sweet Italian chicken or turkey sausage", "1/2", "pound", "casing removed"], ["loosely packed sliced mushrooms", "2", "cups", "such as button, shiitake, or baby bella"], ["garlic", "2", "cloves", "minced"], ["kosher salt", "1/2", "teaspoon", "plus more to taste"], ["loosely packed shredded kale", "2", "cups", null], ["apple juice sweetened cranberries", "1/4", "cup", null], ["chopped fresh thyme leaves", "1", "tablespoon", null], ["Freshly ground black pepper", null, null, "to taste"]], "instructions": ["Preheat the oven to 400 degrees F and line a baking sheet with parchment paper.", "Spray the cut sides of the squash with olive oil and sprinkle with salt and pepper. Place them cut-side down on the baking sheet and bake for 15 minutes, then flip and bake another 30-40 minutes, until fork tender.", " In a small lidded saucepan, combine the rice, cooking liquid and salt and place over high heat. Bring to a boil, turn the heat down to low and simmer for 35-40 minutes, until tender. Drain any excess liquid and set aside. ", "Heat 1 tablespoon olive oil in a medium skillet over medium heat. Crumble the sausage into a skillet and cook until lightly browned, but still pink in some areas.", "Add the mushrooms, garlic and a pinch of salt, and cook, stirring until the mushrooms are soft, about 2 minutes. Stir in the kale, and cook until completely wilted, about 2 minutes.", "Add the cranberries and 1 tablespoon of the chopped thyme and stir to combine. Season with salt and pepper and remove from heat. Toss with the prepared rice.", "Once the squash is done, set it aside until cool enough to safely handle.", "Cupping the sides of the squash with one hand so that it doesn’t tear, spoon out some of the flesh, leaving a 3/4” border around the sides and bottom.", " Dice the remaining squash in small pieces and mix with the rice and sausage.", "Divide the sausage mixture between the hollowed out squash halves and fill to the top, mounding in the middle if there is extra. Return to the oven to cook for another 5 minutes.", "Arrange on a platter and serve immediately."]}