{"original_url": "https://www.skinnytaste.com/butternut-squash-galette/", "prep_time": "30 mins", "cook_time": "1 hr", "ingredients": [{"ingred_name": "yellow onion", "amount": "2", "unit": "large"}, {"ingred_name": "Kosher salt", "amount": "1/2", "unit": "teaspoon"}, {"ingred_name": "extra virgin olive oil", "amount": "2", "unit": "tablespoons"}, {"ingred_name": "refrigerated pie crust dough", "amount": null, "unit": "11-inch"}, {"ingred_name": "peeled and sliced butternut squash", "amount": "12", "unit": "ounces"}, {"ingred_name": "Freshly ground black pepper", "amount": null, "unit": null}, {"ingred_name": "grated Parmesan cheese", "amount": "1/2", "unit": "cup"}, {"ingred_name": "fresh thyme leaves", "amount": "2", "unit": "teaspoons"}, {"ingred_name": "egg", "amount": "1", "unit": "large"}], "instructions": "Preheat the oven to 400 degrees F and line a baking sheet with parchment paper. Peel the butternut squash and slice the thinner end, which is solid and has no seeds, with a mandolin into 1/8-inch thick slices, so you get perfect rounds. Cut until you have 12 ounces. Set the rest aside for another use. Heat a cast-iron or other heavy skillet over medium and add 1 tablespoon of olive oil to the pan and swirl to coat. Add the onions and 1/4 teaspoon of salt. Lower the heat to medium-low heat, and cook, stirring often until caramelized, about 30 minutes. Remove from the pan and set aside to cool. In a medium mixing bowl, toss the sliced butternut with the remaining olive oil, another 1/4 teaspoon of salt, half of the Parmesan cheese, half of the thyme and a few cracks of black pepper. Roll the pastry out on a parchment paper lined sheet pan and prick the pastry with a fork in several places, avoiding the outer 1 1/2-inch border. Spread 1/3 of the caramelized onions on the bottom of the crust, again avoiding the outer border. Arrange the sliced butternut on top of the onions in several concentric layers, nestling the remaining half of the onions between the layers of butternut squash. Sprinkle the top with the remaining Parmesan and thyme leaves. Fold the edges of the pastry up onto the butternut squash, making pleats as you move around the circle. Brush the edges of the brush with the egg. Tent with foil, tightly over the baking sheet and bake for 30 minutes, then remove the foil and bake until the pastry is golden-brown and the butternut is tender, about 20 to 30 minutes more. (check the center of the squash with a toothpick to make sure it's tender) Slice into 6 pieces and serve warm.", "name": "Butternut Squash Galette", "author": "SkinnyTaste"}