{"original_url": "https://www.skinnytaste.com/fennel-gratin/", "prep_time": "10 mins", "cook_time": "1 hr", "ingredients": [{"ingred_name": "large fennel bulbs", "amount": "2", "unit": null}, {"ingred_name": "small yellow onion", "amount": "1", "unit": null}, {"ingred_name": "olive oil", "amount": "1 1/2", "unit": "tablespoons"}, {"ingred_name": "Kosher salt and freshly ground black pepper", "amount": "1 1/2", "unit": "teaspoons"}, {"ingred_name": "vegetable or chicken broth", "amount": "3/4", "unit": "cup"}, {"ingred_name": "about 1/2 cup grated Gruyere cheese", "amount": "2", "unit": "ounce"}, {"ingred_name": "about 1/2 cup finely grated Parmesan cheese", "amount": "1", "unit": "ounce"}, {"ingred_name": "Panko breadcrumbs", "amount": "1/3", "unit": "cup"}, {"ingred_name": "freshly ground nutmeg", "amount": "1/8", "unit": "teaspoon"}], "instructions": "Preheat the oven to 325 degrees F. Trim, quarter, and slice out the woody core of the fennel bulbs. Slice them into 1/2-inch thick wedges. Slice the onion into 1/4-inch slices. Place a 12-inch cast iron or other oven-safe skillet over medium-low heat and drizzle in the olive oil. Arrange the fennel wedges concentrically in the skillet, and tuck the slices of onion in between the fennel. Sprinkle with 1 teaspoon of salt and a few cracks of pepper. Cook, shaking the pan slightly now and then, for about 5 minutes. Keep the heat low enough that the pan doesn’t smoke. Once the mixture is giving off a nice fragrance, pour in the broth and carefully transfer the skillet to the oven. Meanwhile, in a small bowl, mix the panko, Parmesan, Gruyere, Panko, nutmeg, and the remaining 1/2 teaspoon salt and a few cracks of pepper. Bake the fennel for 45 minutes, or until the fennel is tender then remove the dish from the oven, raise the temperature to 375 degrees F, sprinkle the Gruyere mixture over the top and return to the oven for 15-20 minutes, or until the top is golden and crispy. Allow to cool for 5-10 minutes then garnish with a few chopped fennel fronds.", "name": "Fennel Gratin", "author": "SkinnyTaste"}