{"original_url": "https://www.skinnytaste.com/savory-steel-cut-oats/", "prep_time": "5 mins", "cook_time": "12 mins", "ingredients": [{"ingred_name": "quick cooking steel cut oats", "amount": "¼", "unit": "cup"}, {"ingred_name": "Olive oil spray", "amount": null, "unit": null}, {"ingred_name": "raw chicken breakfast sausage", "amount": "2", "unit": "ounces"}, {"ingred_name": "unsalted butter", "amount": "1 1/2", "unit": "teaspoons"}, {"ingred_name": "baby bella mushrooms", "amount": "4", "unit": "medium"}, {"ingred_name": "Kosher salt", "amount": null, "unit": null}, {"ingred_name": "Freshly ground black pepper", "amount": null, "unit": null}, {"ingred_name": "Parmesan cheese", "amount": "2", "unit": "tablespoons"}, {"ingred_name": "egg", "amount": "1", "unit": "large"}, {"ingred_name": "Chopped fresh chives", "amount": null, "unit": null}], "instructions": "In a medium sized, deep microwave-safe bowl, add oats and water and cook according to package directions, about 7 to 10 minutes. You may need to adjust cook time and/or add extra water to reach your desired consistency. (I used about 2/3 cup water for creamy oats). Meanwhile, spray a medium skillet with oil. Remove the sausage from the casing, add to the skillet and cook over medium heat, breaking up with a wooden spoon, until just cooked through (don’t overcook or it will become rubbery). Remove sausage from skillet and place in a serving bowl, cover and set aside while you cook the mushrooms. Add 1 teaspoon butter to the skillet.  When melted, add the mushrooms, a pinch of salt and pepper, to taste. Sauté mushrooms for 4 minutes. Add the sausage back to the skillet, stir to combine and cook 30 seconds. Transfer cooked oats to a bowl, add remaining half teaspoon butter, a pinch of salt and 1 tablespoon Parmesan and stir. Top with mushroom and sausage mixture. Cook the egg runny, or to your likie and top the bowl.  Add the remaining tablespoon Parmesan cheese and chives, if using.", "name": "Savory Steel Cut Oats", "author": "SkinnyTaste"}