{"original_url": "https://www.skinnytaste.com/sheet-pan-thanksgiving-dinner/", "prep_time": "20 mins", "cook_time": "50 mins", "ingredients": [{"ingred_name": "boneless turkey breast", "amount": "1", "unit": null}, {"ingred_name": "kosher salt", "amount": "2", "unit": "teaspoons"}, {"ingred_name": "freshly ground black pepper", "amount": "½", "unit": "teaspoon"}, {"ingred_name": "garlic cloves", "amount": "2", "unit": "large"}, {"ingred_name": "light mayonnaise", "amount": "¼", "unit": "cup"}, {"ingred_name": "za’atar", "amount": "2½", "unit": "tablespoons"}, {"ingred_name": "sweet potatoes", "amount": "1", "unit": "pound"}, {"ingred_name": "extra-virgin olive oil", "amount": "3", "unit": "tablespoons"}, {"ingred_name": "maple syrup", "amount": "1", "unit": "tablespoon"}, {"ingred_name": "of crushed red pepper flakes", "amount": null, "unit": "Pinch"}, {"ingred_name": "brussels sprouts", "amount": "1", "unit": "pound"}, {"ingred_name": "cumin seeds", "amount": "½", "unit": "teaspoon"}, {"ingred_name": "Fresh lemon juice", "amount": null, "unit": null}], "instructions": "Heat the oven to 400ºF. If the turkey breast comes tied, untie it. Pat the meat dry with paper towels. Season the turkey all over with 1½ teaspoons of the salt and the black pepper, then rub all over with the garlic. In a small bowl, stir together the mayonnaise and za’atar. Transfer 2 tablespoons of the za’atar mayo to a separate small bowl and brush that all over the turkey. Set the remaining za’atar mayo aside. Let the turkey sit at room temperature for 15 minutes while you prepare everything else. In a large bowl, toss together sweet potatoes, 1 tablespoon of the oil, the maple syrup, ¼ teaspoon of the salt, and the red pepper flakes. Place turkey on a rimmed sheet pan and arrange the potatoes in a single layer around it. Roast for 20 minutes. In the same bowl (no need to wash it), toss the brussels sprouts with 2 tablespoons of the oil, the cumin seeds, and the remaining ¼ teaspoon salt. Give the potatoes a toss after roasting for 20 minutes, and push the wedges to one side of the pan to make room for the brussels sprouts. Add the sprouts and continue to roast until the sprouts and potatoes are golden brown and a thermometer inserted in the thickest part of the turkey registers 145ºF, 20 to 30 minutes longer (for a total turkey roasting time of 40 to 50 minutes). Allow the meat to rest for 10 minutes before slicing. Discard turkey skin (to reduce calories, if desired as the nutritional info reflects no skin) and carve. While the turkey is resting, season reserved za’atar mayo to taste and add a little more oil and salt, if needed. Season to taste with lemon juice. Serve the za’atar mayo alongside the turkey and vegetables.", "name": "Sheet Pan Thanksgiving", "author": "SkinnyTaste"}